Repository: gbaychev/NClass
Catalog: src/Translations/Strings.*.resx
Languages: de, es, hu, pt_br, ru, zh_cn

source: About NClass
de: Über NClass
es: Acerca de NClass
hu: NClass névjegye
pt_br: Sobre NClass
ru: О NClass
zh_cn: 关于NClass

# ChangingToAbstractConfirmation
source: If you change the inheritance modifier to abstract, the parent class will also become abstract. Do you want to continue?
de: Wenn Sie den aktuellen gerbten Modifikator auf abstrakt setzen, wird die Elternklasse ebenfalls auf abstrakt umgeändert. Sind Sie sicher, dass Sie dies möchten?
es: Si modifica el modificador de herencia al valor abstracta, la clase padre también será absctracta. ¿Desea continuar?
hu: Ha a módosítót absztraktra változtatja, a tagot tartalmazó osztály is absztrakttá válik. Biztos, hogy folytatni akarja?
pt_br: Se você alterar o modificador da herança para abstrato, a classe pai vai também tornar-se abstrata. Você deseja continuar?
ru: При изменении модификатора наследования на abstract родительский клас тоже станет абстрактным. Вы желаете продолжить?
zh_cn: 若改变继承类的修饰符为抽象类型，则父类也将变为抽象类型。要继续吗？

source: Access
de: Zugriff
es: Acceso
hu: Hozzáférés
ru: Доступ
zh_cn: 可访问性

source: Add New Aggregation
de: Neue Aggregation
es: Nueva agregación
hu: Új aggregáció
pt_br: Adicionar Nova Agregação
ru: Новая агрегация
zh_cn: 添加新聚合

source: Add New Association
de: Neue Assoziation
es: Nueva asociación
hu: Új asszociáció
pt_br: Adicionar Nova Associação
ru: Новая ассоциация
zh_cn: 添加新关联

source: Add New Class
de: Füge neue Klasse hinzu
es: Añadir nueva clase
hu: Új osztály
pt_br: Adicionar Nova Classe
ru: Новый класс
zh_cn: 添加新类

source: Add New Comment
de: Füge neuen Kommentar hinzu
es: Añadir nuevo comentario
hu: Új megjegyzés
pt_br: Adicionar Novo Comentário
ru: Новый комментарий
zh_cn: 添加新备注

source: Add New Comment Relationship
de: Neue Kommentarverbindung
es: Nueva relación de comentario
hu: Új megjegyzés reláció
pt_br: Adicionar Novo Comentário do Relacionamento
ru: Новый комментарий отношения
zh_cn: 添加关系新备注

source: Add New Composition
de: Neue Komposition
es: Nueva composición
hu: Új kompozíció
pt_br: Adicionar Nova Composição
ru: Новая композиция
zh_cn: 添加新组合

source: Add New Delegate
de: Füge neuen Delegaten hinzu
es: Añadir nuevo delegado
hu: Új delegate
pt_br: Adicionar Novo Delegate
ru: Добавить делегат
zh_cn: 添加新委托

source: Add New Dependency
de: Neue Abhängigkeit
es: Nueva dependencia
hu: Új függőség
pt_br: Adicionar Nova Dependência
ru: Новая зависимость
zh_cn: 添加新依赖

source: Add New Enum
de: Füge neue Aufzählung hinzu
es: Añadir nuevo enumerado
hu: Új enum
pt_br: Adicionar Novo Enumerador
ru: Новое перечисление
zh_cn: 添加新枚举

source: Add New Generalization
de: Neue Generalisierung
es: Nueva generalización
hu: Új öröklődés
pt_br: Adicionar Nova Generalização
ru: Новая генерализация
zh_cn: 添加新泛化

source: Add New Interface
de: Füge neue Schnittstelle hinzu
es: Añadir nueva interfaz
hu: Új interfész
pt_br: Adicionar Nova Interface
ru: Создать интерфейс
zh_cn: 添加新接口

source: Add new item:
de: Füge neues Element hinuzu:
es: Añadir nuevo elemento:
hu: Új elem felvétele:
pt_br: Adicionar Novo item:
ru: Новый элемент:
zh_cn: 添加新成员:

source: Add New Nesting
de: Neue Verschachtelung
es: Nuevo elemento anidado
hu: Új tartalmazás
pt_br: Adicionar Nova Nesting
ru: Новое вложение
zh_cn: 新嵌套

source: Add New Realization
de: Neue Realisation
es: Nueva instancia
hu: Új megvalósítás
pt_br: Adicionar Nova Realização
ru: Новая реализация
zh_cn: 添加新实现

source: Add New Structure
de: Füge neue Struktur hinzu
es: Añadir nueva estructura
hu: Új struktúra
pt_br: Adicionar Nova Estrutura
ru: Новая структура
zh_cn: 添加新构造

source: Aggregation
de: Aggregator
es: Agregación
hu: Aggregáció
pt_br: Agregação
ru: Агрегация
zh_cn: 聚合

source: Association
de: Assoziation
es: Asociación
hu: Asszociáció
pt_br: Associação
ru: Ассоциация
zh_cn: 关联

# Author
source: Georgi Baychev
es: Balazs Tihanyi
hu: Tihanyi Balázs
pt_br: Balazs Tihanyi
ru: Balazs Tihanyi

source: Auto Zoom
de: Automatischer Zoom
es: Auto acercar/alejar
hu: Képernyőhöz igazítás
ru: Автоматическое масштабирование
zh_cn: 自动缩放

# ButtonAddItem
source: Add item
de: Hinzufügen
es: Añadir elemento
hu: Felvesz
pt_br: Adiciona Item
ru: Добавить элемент
zh_cn: 添加

# ButtonApply
source: Apply
de: Übernehmen
es: Aplicar
hu: Alkalmaz
pt_br: Aplicar
ru: Применить
zh_cn: 应用

# ButtonBrowse
source: Browse...
es: Localizar...
hu: Tallóz...
ru: Обзор...
zh_cn: 浏览...

# ButtonCancel
source: Cancel
de: Abbrechen
es: Cancelar
hu: Mégse
pt_br: Cancelar
ru: Отмена
zh_cn: 取消

# ButtonClose
source: Close
de: Schließen
es: Cerrar
hu: Bezár
pt_br: Fechar
ru: Закрыть
zh_cn: 关闭

# ButtonGenerate
source: Generate
de: Erzeuge
es: Generar
hu: Generál
pt_br: Gerar
ru: Генерировать
zh_cn: 生成

# ButtonLoad
source: Load
de: Laden
es: Cargar
hu: Betöltés
pt_br: Carregar
ru: Загрузить
zh_cn: 加载

# ButtonModify
source: Modify
de: Bearbeiten
es: Modificar
hu: Módosít
pt_br: Modificar
ru: Изменить
zh_cn: 修改

# ButtonOK
source: OK
es: Aceptar
zh_cn: 确定

# ButtonSave
source: Save
de: Speichern
es: Guardar
hu: Mentés
pt_br: Salvar
ru: Сохранить
zh_cn: 保存

source: Checking for Updates
de: Überprüfe auf Updates
es: Comprobar actualizaciones
hu: Frissítés keresése
pt_br: Verificando por atualizações
ru: Проверяем обновления ...
zh_cn: 检查更新

source: class
es: clase
hu: osztály
pt_br: classe
ru: класс
zh_cn: 类

# ClearRecentList
source: Clear recent files list
de: Lösche Liste zuletzt verwendeter Dateien
es: Limpiar lista de ficheros recientes
hu: Legutóbbi fájlok listájának törlése
pt_br: Limpar arquivos da lista recente
ru: Очистить историю
zh_cn: 清除最近打开文件

source: Code Generation
de: Code erzeugen
es: Generación de código
hu: Kódgenerálás
pt_br: Geração de Código
ru: Генерация кода
zh_cn: 代码生成

# CodeGenerationCompleted
source: Code generation completed successfully.
de: Code wurde erfolgreich erzeugt!
es: Generación de código completada con éxito.
hu: A kódgenerálás sikeresen befejeződött.
pt_br: Geração de código foi concluído com êxito.
ru: Генерация кода успешно завершена.
zh_cn: 代码生成成功。

source: Code generation failed.
de: Bei der Erzeugung des Codes ist ein Fehler aufgetreten
es: Generación de código fallida.
hu: A kódgenerálás sikertelen volt.
pt_br: Geração de código falhou.
ru: При генерация кода возникли ошибки.
zh_cn: 代码生成失败。

source: Code style
de: Code formatieren
es: Estilo de código
hu: Kód stílus
pt_br: Estilo de código
ru: Стиль кода
zh_cn: 编码风格

source: Command failed.
de: Befehl fehlerhaft
es: El comando falló.
hu: Nem lehetett végrehajtani a parancsot.
pt_br: Comando falhou
ru: Команда выполнена с ошибкой.
zh_cn: 命令失败。

source: Comment
de: Kommentar
es: Comentario
hu: Megjegyzés
pt_br: Cometário
ru: Комментарий
zh_cn: 备注

source: Composition
de: Zusammenstellung
es: Composición
hu: Kompozíció
pt_br: Composição
ru: Композиция
zh_cn: 组合

source: Confirmation
de: Bestätigung
es: Confirmación
hu: Megerősítés
pt_br: Confirmação
ru: Подтверждение
zh_cn: 确认

source: Delete
de: Löschen
es: Eliminar
hu: Törlés
pt_br: Deletar
ru: Удалить
zh_cn: 删除

source: Delete selected item(s)
de: Gelöschte Item(s)
es: Eliminar los elementos seleccionados
hu: Kijelölt elem(ek) törlése
pt_br: Item(s) selecionado deletado.
ru: Удалить выделенные элементы?
zh_cn: 删除所选项

source: Dependency
de: Abhängigkeit
es: Dependencia
hu: Függőség
pt_br: Dependência
ru: Зависимость
zh_cn: 依赖

source: Destination:
de: Ziel:
es: Destino:
hu: Célkönyvtár:
pt_br: Destino
zh_cn: 目标路径:

source: Diagram
de: Diagramm
es: Diagrama
pt_br: Diagrama
ru: Диаграмма
zh_cn: 图

source: Diagram style
de: Diagramm style
es: Estilo de diagram
hu: Diagram stílus
pt_br: Estilo do Diagrama
ru: Стиль диаграммы
zh_cn: 图类型

source: « Double click to edit »
de: Zum bearbeiten doppelklicken
es: « Doble clic para modificar »
hu: « Dupla kattintás a szerkesztéshez »
pt_br: « Duplo clique para editart »
ru: « Двойной щелчок для редактирования »
zh_cn: « 双击进行编辑 »

source: Edit Comment
de: Kommentar bearbeiten
es: Editar comentario
hu: Megjegyzés szerkesztése
pt_br: Editar Comentário
ru: Изменить комментарий
zh_cn: 编辑备注

# ErrorsReason
source: Reason
de: Grund
es: Razón
hu: A hiba oka
pt_br: Morivo
ru: Причина
zh_cn: 原因

# ErrorAccessorModifier
source: Invalid accessor modifier.
de: Fehlerhafter Zugriffsmodifier.
es: Modificador de acceso invalido.
hu: Érvénytelen belső láthatósági módosító!
pt_br: Modificador de acesso inválido
ru: Неверный модификатор доступа.
zh_cn: 无效访问修饰符。

# ErrorCannotAddSameBaseInterface
source: Cannot add the same base interface.
de: Es ist nicht möglich das selbe Basisinterface hinzuzufügen.
es: No se puede añadir la misma interfaz base.
hu: Nem lehet kétszer felvenni ugyanazt az ősinterfészt!
pt_br: Não pode adicinar a mesma interface base.
ru: Нельзя добавить тот же базовый интерфейс.
zh_cn: 无法添加相同的基接口

# ErrorCannotAddSameInterface
source: Cannot add the same interface.
de: Es ist nicht möglich die selbe Schnittstelle zu verwenden.
es: No se puede añadir la misma interfaz.
hu: Nem lehet kétszer felvenni ugyanazt az interfészt!
pt_br: Não pode adicionar a mesma interface.
ru: Нельзя добавить тот же интерфейс.
zh_cn: 无法添加相同的接口.

# ErrorCannotCrateDelegate
source: Cannot create delegates in {0}.
de: Es ist nicht möglich folgende Delegaten zu löschen {0}.
es: No se pudo crear los delegados en {0}.
hu: {0} nyelvben nem lehet delegate-et létrehozni!
pt_br: Não pode criar delegates no {0}
ru: Делегат в {0} не может быть создан.
zh_cn: 无法在 {0} 建立委托。

# ErrorCannotCreateRelationship
source: Cannot create relationship between the two objects.
de: Es ist nicht möglich zwischen diesen beiden Objekten auf die gewählte Art eine Verbindung herzustellen.
es: No se pudo establecer la relación entre los dos objetos.
hu: Nem hozható létre a kapcsolat a két objektum között!
pt_br: Não pode criar relacionamento entre dois objetos.
ru: Отношение между двумя объектами не может быть создано.
zh_cn: 无法在两个对象之间建立关系。

# ErrorCannotCreateStructure
source: Cannot create structures in {0}.
de: Es ist nicht möglich folgende Strukturen zu erstellen {0}.
es: No se pudo crear estructuras en {0}.
hu: {0} nyelvben nem lehet struktúrát létrehozni!
pt_br: Não pode criar estruturas no {0}
ru: Структура в {0} не может быть создана.
zh_cn: 无法在 {0} 建立结构体。

# ErrorCannotInherit
source: Cannot inherit from static or sealed class.
de: Es ist nicht möglich von sealed classes zu erben
es: No se puede heredar de una clase estatica o sellada.
hu: Statikus vagy lezárt osztály nem származtatható!
pt_br: Não poder herdar uma classe static ou selada.
ru: Невозможно унаследовать от static или sealed класса.
zh_cn: 无法继承静态或封装类。

# ErrorCannotOverride
source: Cannot override non-virtual method.
de: Die Methode die Sie überschreiben ist nicht als überschreibbar gekennzeichnet. Daher kann die Methode nicht überschrieben werden.
es: No se puede sobreescribir un metodo no-virtual.
hu: A művelet nem virtuális, ezért nem lehet felülírni!
pt_br: Não pode reescrever um método não virtual.
ru: Нельзя переопределить невиртуальный метод.
zh_cn: 无法覆盖非虚方法。

# ErrorCannotSaveFile
source: Cannot save file with unspecified path.
de: Es ist nicht möglich die Datei zu speichern, die Pfadangabe ist nicht korrekt.
es: No se puede guardar un fichero sin especificar una ruta.
hu: Nem lehet elmenteni a fájlt, amíg az elérési útvonal nincs megadva!
pt_br: Não pode salva um arquivos sem um caminho específico.
ru: Укажите путь к файлу.
zh_cn: 无法保存未指定路径文件。

# ErrorCannotSetAccess
source: Cannot set access modifier.
de: Es ist nicht möglich den Zugriffsmodifikator zu ändern.
es: No se pudo fijar la accesibilidad.
hu: A láthatóság nem állítható!
pt_br: Não pode definir um modificador de acesso.
ru: Cannot set accessibility.
zh_cn: 无法设置可访问性。

# ErrorCannotSetModifier
source: Cannot set the modifier.
de: Es ist nicht möglich den Modifikator zu ändern.
es: No se pudo fijar el modificador.
hu: A módosító nem állítható!
pt_br: Não pode definir o modificador.
ru: Невозможно установить модификатор.
zh_cn: 无法设置修饰符。

# ErrorCannotSetStatic
source: Cannot set static modifier.
de: Es ist nicht möglich einen statischen Modifikator zu ändern.
es: No se pudo fijar el modificador estático.
hu: A statikusság nem állítható!
pt_br: Não pode definir um modificador estático.
ru: Невозможно установить модификатор static.
zh_cn: 无法设置静态修饰符。

# ErrorCannotSetType
source: Cannot set type.
de: Dieser Typ kann in diesem Kontext nicht verwendet werden.
es: No se pudo fijar el tipo.
hu: A típus nem állítható!
pt_br: Não pode definir um tipo.
ru: Невозможно изменить тип.
zh_cn: 无法设置类型。

# ErrorConnectToServer
source: Could not connect to the server.
de: Verbindung zum Server fehlgeschlagen.
es: No se pudo conectar con el servidor.
hu: Nem lehetett kapcsolódni a szerverhez.
pt_br: Não foi possível conectar ao servidor.
ru: Невозможно подключиться к серверу.
zh_cn: 无法连接到服务器。

# ErrorConstructorName
source: Constructor's name does not equal with the class name.
de: Der Name des Konstruktors stimmt nicht mit dem der Klasse überein.
es: El nombre del constructor no es igual al nombre de la clase.
hu: A konstruktor neve nem egyezik meg az őt tartalmazó osztályéval!
pt_br: O nome do construtor não é igual ao nome da classe.
ru: Имя конструктора должно совпадать с именем класса.
zh_cn: 构造函数名称与类名不一致。

# ErrorLackOfInitialization
source: Constant variables must be initialized.
de: Konstante Variablen müssen initialisiert werden.
es: La variables constantes deben ser inicializadas.
hu: Konstans csak inicializációval együtt érvényes!
pt_br: As variáveis constantes devem ser inicializadas.
ru: Константы должны быть инициализированы.
zh_cn: 常量必须初始化。

# ErrorCorruptSaveFile
source: The save file is corrupt and could not be loaded.
de: Die Datei ist beschädigt und kann nicht geladen werden.
es: El fichero es invalido y no pudo cargarse.
hu: A mentés fájl hibás. Nem lehetett betölteni.
pt_br: O arquivo salvo está corrompido e não pode ser carregado.
ru: Файл поврежден и не может быть загружен.
zh_cn: 保存文件损坏，无法载入。

# ErrorCorruptSaveFormat
source: Corrupt save format.
de: Die Datei konnte nicht gespeichert werden.
es: Fichero corrupto.
hu: A mentés formátum hiányos vagy nem megfelelő.
pt_br: Formato salvo corrompido.
ru: Неверный формат файла.
zh_cn: 保存格式损坏。

# ErrorCouldNotLoadFile
source: Could not load file.
de: Die Datei konnte nicht geladen werden.
es: No se pudo cargar el fichero.
hu: Nem lehetett betölteni a fájlt.
pt_br: Não é possível carregar o arquivo.
ru: Невозможно открыть файл.
zh_cn: 无法载入文件。

# ErrorCouldNotLoadPlugins
source: There was an error while loading the plugins: {0}
de: In folgenden Plugins traten Fehler auf: {0}
es: Ocurrio un error mientras se cargaban las extensiones: {0}
hu: Hiba a bővítmények betöltése közben: {0}
pt_br: Houve um erro ao carregar os plugins: (0)
ru: Ошибка при загрузке плагина: {0}
zh_cn: 在加载插件时发生错误: {0}

# ErrorCouldNotSaveFile
source: Could not save file.
de: Die Datei konnte nicht gespeichert werden.
es: No se pudo guardar el fichero.
hu: Nem lehetett elmenteni a fájlt.
pt_br: Não foi possível salvar o arquivo.
ru: Ошибка при сохранении файла.
zh_cn: 无法保存文件。

# ErrorCyclicBase
source: The base {0} is successor of the child {0}.
de: Die Basissklasse {0} erbt von {0}.
es: La clase base {0} es ancestro del hijo {1}.
hu: Az ős{0} leszármazottja az {0} gyermeknek.
pt_br: A base {0} é sucessor do filho {0}.
ru: Базовый класс {0} унаследован от потомка {0}.
zh_cn: 基类 {0} 是 {1} 子类的继承类。

# ErrorCyclicNesting
source: Cyclic nesting relationships.
de: Zyklische Verschachtelungen sind nicht möglich.
es: Relaciones de anidación cíclicas.
hu: Ciklikus tartalmazás-kapcsolatok.
pt_br: Indicação de relacionamento cíclico
ru: Циклические вложенные отношения.
zh_cn: 循环嵌套关系。

# ErrorEmptyFilename
source: The file name cannot be empty.
de: Der Dateiname muss angegeben werden
es: El nombre de fichero no puede estar vacío.
hu: A fájlnév nem lehet üres!
pt_br: O nome do arquivo não pode ser vazio.
ru: Укажите имя файла.
zh_cn: 文件名不能为空。

# ErrorEmptyString
source: The {0} cannot be empty string.
de: Der {0} muss ausgefüllt werden.
es: {0} no puede ser una cadena vacía.
hu: A {0} nem lehet üres string!
pt_br: A {0} não pode ser uma string vazia.
ru: {0} не может быть пусто.
zh_cn: {0} 不能为空字符串。

# ErrorExplicitImplementation
source: Cannot implement explicitly.
de: Es ist nicht möglich explizit zu implementieren.
es: No se puede implementar explicitamente.
hu: Nem megengedett az explicit implementálás.
pt_br: Não é possível executar explicitamente.
ru: Явная реализация невозможна.
zh_cn: 无法显示实现。

# ErrorExplicitImplementationAccess
source: Cannot set access modifier in explicit implementing.
de: In einer expliziten Implementierung können keine Zugriffsrechte vergeben werden.
es: No se puede fijar un modificador de acceso en una implementación explícita.
hu: Nem állítható a láthatóság explicit implementálásnál.
pt_br: Não é possível definir o acesso modificador explícito em execução.
ru: Нельзя установить модификатор доступа при явной реализации.
zh_cn: 无法以显示实现方式设置访问修饰符。

# ErrorFileNotFound
source: File not found or no read permission.
de: Datei nicht gefunden/oder es bestehen keine Zugriffsrechte auf diese Datei.
es: Fichero no encontrado o sin permisos de lectura.
hu: A fájl nem található vagy nincs hozzáférési engedély.
pt_br: Arquivo não encontrado ou sem permissão de leitura.
ru: Файл не найден или отсутствует доступ.
zh_cn: 找不到文件或没有读取权限。

# ErrorForbiddenName
source: Forbidden name.
de: Dieser Name ist nicht erlaubt.
es: Nombre prohibido.
hu: Tiltott név!
pt_br: Nome proibido.
ru: Запрещенное имя.
zh_cn: 禁用名称。

# ErrorForbiddenTypeName
source: Forbidden type name.
de: Dieser Dateityp ist nicht erlaubt.
es: Nombre de tipo prohibido.
hu: Tiltott típusnév!
pt_br: Nome de tipo proibido
ru: Запрещенное имя тип.
zh_cn: 禁用类型名。

# ErrorInnerTypeAlreadyNested
source: The inner type is already nested.
de: Der Typ ist bereits verschachtelt.
es: El tipo ya estaba definido como anidado.
hu: A tartalmazandó osztály már tartalmazva van.
ru: Внутренний тип уже вложен.
zh_cn: 内置类型已为嵌套。

# ErrorInterfaceLanguage
source: The interface class is not {0} interface.
es: La clase o interfaz no implementa la interfaz {0}.
hu: Az interfész osztály nem {0} interfész!
pt_br: A interface classe não é (0) interface.
zh_cn: 接口类不属于 {0} 接口

# ErrorInterfaceMemberAccess
source: Cannot set accessibility of interface members.
de: Es ist nicht möglich Member einer Schnittstelle einen Zugriffsmodikator zuzuweisen.
es: No se puede fijar la accesibilidad de los miembros de una interfaz.
hu: Interfész tagjainak láthatósága nem állítható!
pt_br: Não é possível definir acessibilidade da interface membros.
ru: Нельзя устанавливать модификаторы доступа для членов интерфейса.
zh_cn: 无法设置接口成员的可访问性。

# ErrorInvalidBaseType
source: The base type is invalid.
de: Dieser Typ ist fehlerhaft.
es: El tipo base es inválido.
hu: Érvénytelen ősosztály.
pt_br: Tipo da base é inválido.
ru: Неверный базовый класс.
zh_cn: 基类非法。

# ErrorInvalidDeclaration
source: Invalid declaration.
de: Fehlerhafte Deklaration
es: Declaración invalida.
hu: Érvénytelen deklaráció.
pt_br: Declaração inválido.
ru: Неверное определение.
zh_cn: 无效声明

# ErrorInvalidModifier
source: Invalid modifier.
de: Fehlerhafter Modifikator
es: Modificador inválido.
hu: Érvénytelen módosító.
pt_br: Modificador inválido.
ru: Неверный модификатор.
zh_cn: 无效修饰符。

# ErrorInvalidModifierCombination
source: The {0} modifier is invalid with the {1} modifier.
de: Der Modifikator {0} stimm nicht mit folgendem Modifikator überein {1}.
es: No está permitido emplear el modificador {0} junto con el modificador {1}.
hu: A(z) {0} módosító érvénytelen a(z) {1} módosító mellett.
pt_br: O {0} modificador é inválido com o {1} modificador.
ru: Модификатор {0} не может использоваться с модификатором {1}.
zh_cn: 修饰符 {0} 不能与修饰符 {1} 一起使用。

# ErrorInvalidName
source: Invalid name.
de: Fehlerhafter Name.
es: Nombre invalido.
hu: Érvénytelen név!
pt_br: Nome inválido.
ru: Неверное имя.
zh_cn: 无效名称

# ErrorInvalidParameterDeclaration
source: Invalid parameter declaration.
de: Falsche deklaration des Parameters.
es: Declaración de parametro invalido.
hu: Érvénytelen paraméter deklaráció!
pt_br: Declaração do parametro inválido.
ru: Неверное определение параметров.
zh_cn: 无效参数声明。

# ErrorInvalidTypeName
source: Invalid type name.
de: Falscher Typname.
es: Tipo de nombre invalido.
hu: Érvénytelen típusnév!
pt_br: Nome de tipo inválido.
ru: Неверное имя типа.
zh_cn: 无效类型名称。

source: Error in saving image.
de: Fehler bei speichern des Bildes.
es: Error al guardar la imagen.
hu: Hiba a kép elmentése közben.
pt_br: Erro ao salvar a imagem
ru: Ошибка сохранения изображения.
zh_cn: 保存图像出错。

source: Error in saving settings.
de: Fehler bei speichern der Einstellungen.
es: Error al guardar las preferencias.
hu: Hiba a beállítások mentése közben.
pt_br: Erro ao salvar as configurações
ru: Ошибка при сохранении параметров.
zh_cn: 保存设置出错。

# ErrorLanguagesDoNotEqual
source: Languages do not equal.
de: Sprache nicht verfügbar.
es: Los lenguajes no son iguales.
hu: Nem azonos a két nyelv!
pt_br: Linguagens diferentes.
ru: Разные языки.
zh_cn: 语言不相同

# ErrorMemberTypeDoesNotExist
source: {0} type of member does not exist.
de: Folgende Typen exsistieren nicht {0}
es: El tipo {0} del miembro no existe.
hu: Nincs {0} típusú tag!
pt_br: {0} tipo de membro não existe.
ru: Тип {0} члена не существует.
zh_cn: {0} 成员类型不存在。

# ErrorMultipleBases
source: Multiple bases are not supported.
de: Mehrfache Basisklassen werden nicht unterstützt.
es: La herencia multiple no esta soportada.
hu: Nem támogatott a többszörös öröklődés.
pt_br: Henrança múltipla não é suportada.
ru: Множественное наследование не поддерживается.
zh_cn: 不支持多基类。

# ErrorNestingNotSupported
source: Parent type does not support nesting.
de: Basistyp unterstützt keine Verschachtelung
es: El tipo padre no soporta anidación.
hu: A tartalmazó osztály nem támogatja a tartalmazást.
ru: Родительский тип не может быть вложенным.
zh_cn: 父类不支持嵌套。

# ErrorNotAllowedChild
source: Derived type does not support generalization.
de: Abgeleitete Typen können nicht generalisiert werden.
es: El tipo derivado no soporta generalización.
hu: A gyermek osztály nem támogatja az általánosítást.
pt_br: Tipo derivado não suporta generelização.
ru: Порожденный тип не поддерживает генерализацию.
zh_cn: 派生类不支持泛化。

# ErrorNotAllowedParent
source: Base type does not support generalization.
de: Basisstypen können nicht generalisiert werden.
es: El tipo base no soporta generalización.
hu: A szülő osztály nem támogatja az általánosítást.
pt_br: Tipo base não suporta generalização.
ru: Базовый тип не поддерживает
zh_cn: 基类不支持泛化。

# ErrorNotInterfaceImplementer
source: Implementer class cannot realize the interface.
de: Implementierende Klasse kann die Schnittstelle nicht realisieren.
es: La clase de implementación no puede implementar la interfaz.
hu: Az implementáló osztály nem tudja megvalósítani az interfészt.
ru: Реализующий класс не может реализовывать интерфейс.
zh_cn: 实例类不能实现接口。

# ErrorOperatorMustBePublic
source: Operator method must be public.
de: Diese Methode muss als public deklariert werden.
es: El método operador debe ser público.
hu: Operátornak kötelező publikusnak lennie!
pt_br: Método operador precisa ser público.
ru: Оператор должен быть public.
zh_cn: 操作方法必须是公有类型。

# ErrorOperatorMustBeStatic
source: Operator method must be static.
de: Diese Methode muss als static deklariert werden.
es: El método operador debe ser estático.
hu: Operátornak kötelező statikusnak lennie!
pt_br: Método operador precisa ser estático.
ru: Оператор должен быть static.
zh_cn: 操作方法必须是静态类型。

# ErrorParameterType
source: Parameter's type cannot be {0}.
de: Dieser Parameter kann nicht {0} sein.
es: El tipo del parametro no puede ser {0}.
hu: A paraméter típusa nem lehet {0}!
pt_br: Tipo de parametro não pode ser {0}.
ru: Параметр не может быть {0}.
zh_cn: 参数类型不能为 {0}。
