Repository: gbaychev/NClass
Catalog: src/Translations/Strings.*.resx
Languages: de, es, hu, pt_br, ru, zh_cn

# ShowChevron
source: Show chevron button:
de: Zeige Detail-Umschalter
es: Mostrar el boton de colapsado
hu: Mutassa a nyitó/záró gombot:
ru: Показывать кнопку:
zh_cn: 显示箭头按钮:

# ButtonPageSetup
source: Page setup...
de: Seite einrichten...
es: Configuración de página...
hu: Oldalbeállítás...
pt_br: Configuração de Página...
ru: Параметры страницы...
zh_cn: 页面设置...

# ButtonPrint
source: Print
de: Drucken
es: Imprimir
hu: Nyomtat
pt_br: Imprimir
ru: Печать
zh_cn: 打印

# ButtonSelectPrinter
source: Select printer...
de: Wähle Drucker...
es: Seleccionar impresora...
hu: Nyomtató kiválasztása...
pt_br: Selecione a impressora...
ru: Принтер...
zh_cn: 选择打印机...

source: Pages:
de: Seiten:
es: Páginas:
hu: Oldalak:
pt_br: Páginas:
ru: Страницы:
zh_cn: 页码:

source: Print only selected elements
de: Drucke nur ausgewählte Elemente
es: Imprimir solo elementos seleccionados
hu: Csak a kijelölt elemek nyomtatása
pt_br: Imprimir apenas elementos selecionados
ru: Печатать только выбранные
zh_cn: 只打印所选元素

source: Critical Error
de: Schwerer Fehler
es: Error crítico
hu: Végzetes hiba
pt_br: Erro crítico
ru: Критическая ошибка
zh_cn: 严重错误

# ProgramTerminates
source: A critical error has occurred, the program must be terminated. A crash log and recovery files have been created in the Application Data directory.
de: Es ist ein schwerwiegender Fehler aufgetreten, das Programm wurde deshalb geschlossen. Für nähere Information steht Ihnen das Fehlerprotokoll im Anwendungsverzeichnis zur Verfügung.
es: Un error crítico ha ocurrido. El programa se cerrará. Un log del problema y ficheros de recuperación han sido creados en el directorio de datos de la aplicación.
hu: Egy végzetes hiba miatt a programnak le kellett állnia. A hibát leíró fájl és a megnyitott projektek az Application Data könyvtárba kerültek mentésre.
pt_br: Um erro crítico ocorreu, o programa deve ser encerrado. Um crash log e recuperação ficheiros foram criados no diretório Application Data.
ru: Произошла критическая ошибка. Приложение должно быть закрыто.
zh_cn: 产生了一个严重错误，程序终止。崩溃日志文件与恢复文件已创建在Application Data文件夹。

# SendLogFile
source: Please send this file to the address '{0}'.
de: Bitte senden Sie die Datei an folgende Adresse '{0}'.
es: Por favor envíe este fichero a la dirección '{0}'.
hu: Kérem, küldje el ezt a fájlt a '{0}' címre a hiba mihamarabbi kijavítása érdekében.
pt_br: Por favor mande esse arquivo para '{0}'.
ru: Пожалуста, вышлите этот файл по адресу '{0}'.
zh_cn: 请发送此文件到 '{0}'

# MenuSize
source: &Size
de: &Größe
es: &Tamaño
hu: &Méret
pt_br: &Tamanho
ru: &Размер
zh_cn: 大小(&S)

# MenuSaveSelectionAsImage
source: &Save Selection as Image...
de: &Speichere Auswahl als Bild...
es: &Guardar selección como imagen...
hu: &Kijelölt elemek mentése képként...
pt_br: &Salvar a Seleção Como imagem...
ru: Сохранить в&ыбранное как изображение
zh_cn: 保存所选为图像(&S)...

# MenuAutoRouting
source: &Auto routing
es: &Autoenrutado
hu: &Automatikus útvonal
ru: Связывать &автоматически
zh_cn: 自动路径(&A)

# MenuProperties
source: &Properties
de: &Eigenschaften
es: &Propiedades
hu: &Tulajdonságok...
pt_br: &Propriedades
ru: &Свойства
zh_cn: 属性(&P)

# MenuCollapseAllSelected
source: &Collapse All Selected
de: &Klappe die ausgewählten Elemente ein
es: &Colapsar los selecionados
hu: &Kijelöltek összecsukása
pt_br: Re&colher todo os selecionados
ru: &Свернуть все выбранные
zh_cn: 全部折叠所选(&C)

# MenuExpandAllSelected
source: &Expand All Selected
de: &Klappe die ausgewählten Elemente aus
es: &Expandir los seleccionados
hu: &Kijelöltek kibontása
pt_br: &Expandir Todos Selcionados
ru: &Развернуть все выбранные
zh_cn: 全部展开所选(&E)

# MenuUnidirectional
source: &Unidirectional
es: &Unidireccional
hu: &Egyirányú
pt_br: &Unidirecional
ru: Одно направление
zh_cn: 单向性(&U)

# MenuZoom
source: &Zoom
es: &Acercar y alejar
hu: &Nagyítás
ru: &Масштаб
zh_cn: 缩放(&Z)

# MenuZoomIn
source: Zoom &In
de: Zoom &Rein
es: &Acercar
hu: &Nagyítás
ru: У&величить масштаб
zh_cn: 放大(&I)

# MenuZoomOut
source: Zoom &Out
de: Zoom &Raus
es: A&lejar
hu: &Kicsinyítés
ru: У&меньшить масштаб
zh_cn: 缩小(&O)

source: NClass Project Files
de: NCLass Projekt-Datei
es: Ficheros de proyecto NClass
hu: NClass projekt fájlok
pt_br: Arquivos do Projeto NClass
ru: Файлы проектов NClass
zh_cn: NClass工程文件

# ErrorBlankFilename
source: File name cannot be empty.
de: Der Dateiname kann nicht leer sein.
es: El nombre de fichero no puede ser vacío.
hu: A fájlnév nem lehet üres.
pt_br: Nome do arquivo não pode ser vazio.
ru: Имя файла не может быть пустым
zh_cn: 文件名不能为空。

# ErrorDestructorName
source: Destructor's name does not equal with the class name.
de: Der Names des Destruktors stimmt nicht mit dem Klassennamen überein
es: El nombre del destructor no es igual al nombre de la clase.
hu: A destruktor neve nem egyezik meg az őt tartalmazó osztályéval!
pt_br: O nome do destrutor não é igual ao nome da classe.
ru: Имя деструктора не совпадает с именем класса.
zh_cn: 析构函数名与类型不一致。

# DoubleClickToAddDiagram
source: Double click here to add new diagram
de: Doppelklicken Sie hier um ein neues Diagramm zu erstellen.
es: Haga doble clic aqui para añadir un nuevo diagrama
hu: Új diagramhoz kattintson duplán
pt_br: Duplo clique para adicionar um novo diagrama
ru: Шелкните здесь, чтобы добавить новую диаграмму
zh_cn: 双击此处添加新图

# DoubleClickToAddProject
source: « Double click here to add new project »
de: « Doppelklicken Sie hier um ein neues Projekt zu erstellen »
es: « Haga doble clic aqui para añadir un nuevo proyecto »
hu: « Új projekthez kattintson duplán »
pt_br: « Duplo clique aqui para adicionar um novo projeto»
ru: Шелкните здесь, чтобы добавить новый проект
zh_cn: « 双击此处添加新工程 »

# MenuSaveProject
source: &Save {0}
de: &Speichere {0}
es: &Guardar {0}
hu: {0} &mentése
pt_br: &Salvar {0}
ru: &Сохранить {0}
zh_cn: 保存 {0} (&S)

# MenuSaveProjectAs
source: Save {0} &As...
de: Speichere {0} &Als...
es: Guardar {0} &como...
hu: {0} menté&se másként...
pt_br: Salve {0} &Como...
ru: Сохранить {0} &как...
zh_cn: {0} 另存为(&A)...

# MenuClose
source: &Close {0}
de: &Schließe {0}
es: &Cerrar {0}
hu: {0} be&zárása
pt_br: &Fechar {0}
ru: &Закрыть {0}
zh_cn: 关闭(&C) {0}

# MenuCloseAllProjects
source: Close All P&rojects
de: Schließe alle P&rojekte
es: Cerrar todos los &proyectos
hu: Minden projekt &bezárása
pt_br: Fechar todos os P&rojetos
ru: Закрыть &все проекты
zh_cn: 关闭所有工程(&r)

# MenuCloseProject
source: &Close Project
de: &Schließe Projekt
es: &Cerrar proyecto
hu: Projekt be&zárása
pt_br: &Fechar Projeto
ru: &Закрыть проект
zh_cn: 关闭工程(&C)

# MenuSaveAllProjects
source: Sa&ve All Projects
de: Spe&ichere alle Projekte
es: Sal&var todos los proyectos
hu: Minden &projekt mentése
pt_br: Sa&var Todos os Projetos
ru: Сохранить все &проекты
zh_cn: 保存所有工程(&v)

source: Previous File Formats
de: Früheres Datei-Format
es: Formatos de fichero previos
hu: Régebbi formátumok
pt_br: Forma de arquivo anterior
ru: Предыдущие типы файлов
zh_cn: 上次文件格式

# MenuCloseAllDocuments
source: &Close All Documents
de: Schließe alle Do&kumente
es: &Cerrar todos los documentos
hu: &Minden dokumentum bezárása
pt_br: &Fechar todos os documentos
ru: &Закрыть все документы
zh_cn: 关闭所有文档(&C)

# MenuDiagramNavigator
source: Diagram &Navigator
de: Diagramm &Navigation
es: &Navegador de diagramas
pt_br: Diagrama &Navigação
ru: &Навигатор диаграммы
zh_cn: 图导航(&N)

# MenuModelExplorer
source: Model &Explorer
es: &Explorador de modelos
pt_br: &Explorar modelo
zh_cn: 模型浏览器(&E)

# MenuView
source: &View
de: &Ansicht
es: &Ver
hu: &Nézet
pt_br: &Ver
ru: В&ид
zh_cn: 视图(&V)

# AskSaveChanges
source: Save changes to the following projects?
de: Sollen die Änderungen für dieses Projekt gespeichert werden?
es: ¿Deseal guardar los cambios a los siguientes proyectos?
hu: Elmenti a változásokat a következő projektekben?
pt_br: alve as alterações para os seguintes projetos?
ru: Сохранить изменения в следующих проектах?
zh_cn: 保存更改到以下工程？

# RequiresRestart
source: Changing the language requires application restart.
de: Das Ändern der Spracheinstellung wird erst nach einem Anwendungsneustart wirksam.
es: Cambiar el idioma requiere reiniciar la aplicación.
hu: A nyelv megváltoztatásához újraindítás szükséges.
pt_br: Mudança de Língua requer reinício da aplicação.
ru: После изменения языка приложение должно быть перезапущено.
zh_cn: 改变语言需要重启程序。

# MenuNewProject
source: &New Project
de: &Neues Projekt
es: &Nuevo proyecto
hu: &Új projekt
pt_br: &Novo Projeto...
ru: &Новый проект
zh_cn: 新工程(&N)

# DeleteProjectItemConfirmation
source: Are you sure you want to delete {0}?
de: Sind Sie sicher, dass Sie {0} löschen wollen?
es: ¿Está seguro de que desea borrar {0}?
hu: Biztos, hogy törölni akarja a következőt: {0}?
pt_br: Tem certeza de deseja deletar o {0}?
ru: Вы уверены, что хотите удалить {0}?
zh_cn: 确定要删除 {0}？

# MenuDeleteProjectItem
source: &Delete From Project
de: &Lösche aus dem Projekt
es: &Borrar desde proyecto
hu: &Törlés a projektből
pt_br: &Deletar do projeto
ru: &Удалить из проекта
zh_cn: 从工程删除(&D)

# MenuRename
source: &Rename
de: &Umbenennen
es: &Renombrar
hu: &Átnevezés
pt_br: &Renomear
ru: П&ереименовать
zh_cn: 重命名(&R)

# MenuProject
source: &Project
de: &Projekt
es: &Proyecto
hu: &Projekt
pt_br: &Projeto
ru: &Проект
zh_cn: 工程(&P)

# ErrorNoPrinters
source: No printers are installed.
de: Kein Drucker installiert.
es: No hay impresoras instaladas.
hu: Nincs nyomtató telepítve.
pt_br: Inpressora não instalada.
ru: Принтеры не установлены.
zh_cn: 没有安装打印机。

# SolutionType
source: Type of solution file:
de: Typ der Solution:
es: Tipo de fichero de solución:
hu: Solution fájl típusa:
pt_br: Tipo de arquivo da solução :
ru: Тип файла:
zh_cn: 解决方案文件类型:

# UseNotImplementedExceptions
source: Fill methods with 'Not implemented' exceptions
de: Fülle Methoden mit 'NotImplementedException'
es: Completar métodos con excepciones 'Non implemented'
hu: 'Not implemented' kivételeket a metódusokhoz
pt_br: Preencha os métodos 'Not implemented' exceptions
ru: Заполнить методы NotImplementedExeption
zh_cn: 方法抛出“未实现”异常

# WhenZoomed
source: When zoomed in/out
de: Wenn zoom
es: Al acercar o alejar
hu: Amikor nagyítva/kicsinyítve van
pt_br: Quando zoom in/out
ru: При изменении масштаба
zh_cn: 在放大/缩小时

source: Use ClearType
de: Nutze ClearType
es: Usar ClearType
hu: ClearType használata
pt_br: Usar ClearType
ru: Использовать ClearType
zh_cn: 使用清晰字体

source: None
de: Nichts
es: Ninguno
hu: Nincs
pt_br: Nada
ru: Нет
zh_cn: 无

source: Read-only
es: Solo lectura
hu: Csak olvasható
pt_br: Apenas Leitura
ru: Только чтение
zh_cn: 只读

source: Read-Write
es: Lectura-escritura
hu: Írható-olvasható
pt_br: Leitura e Escrita
ru: Чтение/запись
zh_cn: 读写

source: Write-only
es: Solo escritura
hu: Csak írható
pt_br: Apenas Escrita
ru: Только запись
zh_cn: 只写

source: New Parameter
de: Neuer Parameter
es: Nuevo parámetro
hu: Új paraméter
pt_br: Novo parametro
ru: Новый параметр
zh_cn: 新参数

source: New Value
de: Neuer Wert
es: Nuevo valor
hu: Új érték
pt_br: Novo Valor
ru: Новое значение
zh_cn: 新值

source: Edit Association
de: Assoziation bearbeiteten
es: Editar asociación
hu: Asszociáció szerkesztése
pt_br: Editar Associação
ru: Редактировать
zh_cn: 编辑关联

# MenuEditAssociation
source: Edit...
de: Bearbeiten...
es: Editar...
hu: Szerkesztés...
pt_br: Editar...
ru: Редактировать...
zh_cn: 编辑...

# RememberOpenProjects
source: Remember open projects on close
de: Führe eine Liste mit zuletzt geöffneten Dateien
es: Recordar los proyectos abiertos al cerrar
hu: Emlékezzen az utoljára megnyitott projektekre
ru: Запоминать открытые проекты при выходе
zh_cn: 在关闭时记住打开的工程

# MenuCloseAllTabsButThis
source: Close All But This
de: Schließe alle bis auf dieses
es: Cerrar todo salvo este
hu: Összes többi fül bezárása
pt_br: Fechar todos mas Este
ru: Закрыть все кроме этой
zh_cn: 除此之外全部关闭

# MenuCloseAllTabs
source: Close All
de: Schließe alle
es: Cerrar todo
hu: Összes fül bezárása
pt_br: Fechar todos
ru: Закрыть все
zh_cn: 全部关闭

# MenuCloseTab
source: Close
de: Schließen
es: Cerrar
hu: Fül bezárása
pt_br: Fechar
ru: Закрыть
zh_cn: 关闭

# MenuCopy
source: &Copy
de: &Kopieren
es: &Copiar
hu: &Másolás
pt_br: &Copiar
ru: &Копировать
zh_cn: 复制(&C)

source: Copy
de: Kopieren
es: Copiar
hu: Másolás
pt_br: Copiar
ru: Копировать
zh_cn: 复制

source: Cut
de: Ausschneiden
es: Cortar
hu: Kivágás
pt_br: Cortar
ru: Вырезать
zh_cn: 剪切

source: Paste
de: Einfügen
es: Pegar
hu: Beillesztés
pt_br: Colar
ru: Вставить
zh_cn: 粘贴

# MenuOpenFile
source: &File...
de: &Datei...
es: &Archivo...
hu: &Fájl...
ru: &Файл...
zh_cn: 文件(&F)...

# UseClearTypeForImages
source: In exported images (disables transparency)
de: In exportierten Bildern (keine Transparenz möglich)
es: En imagenes exportadas (trasparencia deshabilitada)
hu: Képbe mentésnél (átlátszóság elvesztésével jár)
ru: В экспортируемых изображениях (отключает прозрачный фон)
zh_cn: 在导出的图像中(禁用透明)

# MenuReverse
source: Reverse
de: &Umkehren
es: Invertir
hu: Megfordít
ru: Изменить направление
zh_cn: 逆向

# MenuAutoSize
source: Auto &Size
de: Automatische G&rößenanpassung
es: Auto ajustar &tamaño
hu: Automatikus &méret
ru: Автоматический &размер
zh_cn: 自动大小(&S)

# DeleteMemberConfirmation
source: Are you sure you want to delete the selected member?
de: Möchten Sie wirklich die selektierten Member löschen?
es: ¿Está seguro de que desea eliminar el miembro seleccionado?
hu: Biztos, hogy törölni akarja a kijelölt tagot?
ru: Вы уверены, что хотите удалить выбранный член?
zh_cn: 确定要删除所选取成员吗？

# DeleteElementsConfirmation
source: Are you sure you want to delete the selected diagram element(s)?
de: Möchten Sie wirklich die selektierten Elemente löschen?
es: ¿Está seguro de que desea eliminar los elementos seleccionados en el diagrama?
hu: Biztos, hogy törölni akarja a kijelölt diagram elemeket?

# ButtonClear
source: Clear
de: Zurücksetzen
es: Limpiar
hu: Törlés

source: General
de: Haupt
hu: Általános
pt_br: Geral
ru: Общие
zh_cn: 常规

# MenuAutoZoom
source: Auto &Zoom
hu: &Képernyőhöz igazítás
ru: Автоматическое масштабирование
zh_cn: 自动缩放(&Z)

source: Error
de: Fehler
hu: Hiba
pt_br: Erro
ru: Ошибка
zh_cn: 错误

# CodeGenerationOverwriteConfirmation
source: The output directory is not empty, the previous files will be overwritten. Do you still want to continue?
de: Das Ausgabeverzeichnis ist nicht leer, die alten Dateien werden überschrieben. Möchten Sie fortfahren?
