Repository: gbaychev/NClass
Catalog: src/Translations/Strings.*.resx
Languages: de, es, hu, pt_br, ru, zh_cn

# ErrorReadVersionData
source: Could not read version data.
de: Die Versionierung konnte nicht gelesen werden.
es: No se pudo recuperar la información de versión.
hu: Hiba a verzió adatok beolvasásakor.
pt_br: Não foi possível ler os dados da versão.
ru: Невозможно получить информацию о версии.
zh_cn: 无法读取版本信息。

# ErrorRecursiveNesting
source: Types cannot contain themselves.
de: Typen können nicht von sich selbst erben.
es: Un tipo no puede contenerse a si mismo.
hu: A típusok nem tartalmazhatják saját magukat.
pt_br: Tipos não podem conter eles mesmos.
ru: Типы не могут содержать друг друга.
zh_cn: 类型无法包含自身。

# ErrorRelationshipDoesNotExist
source: The specified relationship does not exist.
de: Die Assoziation exsistiert nicht.
es: La relación especificada no existe.
hu: Nem létezik ilyen kapcsolat.
pt_br: O relacionamento expecífico não existe.
ru: Указанное отношение не существует.
zh_cn: 指定关系不存在。

# ErrorReservedName
source: This is a reserved name.
de: Sie haben einen reservierten Namen verwendet; dies ist nicht möglich.
es: Esta es una palabra reservada.
hu: A megadott név már szerepel!
pt_br: Este é um nome reservado
ru: Это зарезервированное имя.
zh_cn: 这是保留关键字。

# ErrorStaticConstructor
source: Static constructors must be parameterless.
de: Statische Konstruktoren müssen Parameterlos sein.
es: Un constructor estático no debe contener parametros.
hu: Csak paraméter nélküli konstruktor lehet statikus!
pt_br: Construtor estático não pode ter parametros.
ru: Статический конструктор не может иметь параметры.
zh_cn: 静态构造函数必须无参。

# ErrorStaticInterfaceMember
source: Interface members cannot be static.
de: Ein Interface kann nicht als static deklariert werden.
es: Los miembros de una interfaz no pueden ser estáticos.
hu: Interfész tagjai nem lehetnek statikusok!
ru: Члены интерфейса не могут быть static.
zh_cn: 接口成员不能是静态类型。

# ErrorType
source: Type cannot be {0}.
de: Der Typ kann nicht {0} sein.
es: El tipo no puede ser {0}.
hu: A típus nem lehet {0}!
pt_br: O tipo não pode ser {0}.
ru: Тип не может быть {0}.
zh_cn: 类型不能为 {0}

# ErrorTypeDoesNotExist
source: {0} type does not exist.
de: {0} exsistiert als nicht Typ.
es: El tipo {0} no existe.
hu: Nincs {0} nevű típus!
ru: Тип {0} не существует.
zh_cn: {0} 类型不存在。

source: Generalization
de: Haupteinstellung
es: Generalización
hu: Általánosítás
pt_br: Generalização
ru: Генерализация
zh_cn: 泛化

# GeneratorTargetDir
source: Select the target directory for the generated source files:
de: Wählen Sie ein Verzeichniss, in dem der Quellcode generiert werden soll:
es: Selecione el directorio destino para el código fuente generado:
hu: Válassza ki a generálandó forrásfájlok célkönyvtárát:
pt_br: Selecione o diretório para a geração do código fonte.
ru: Укажите папку, куда будут сохранены сгенерированные файлы:
zh_cn: 选择生成代码文件的目录:

source: Implementing
de: Schnittstellen implementieren
es: Implementando
hu: Implementálás
pt_br: Implementação
ru: Реализация
zh_cn: 实现

source: Implement explicitly
de: Explizite Implementierung
es: Implementación explícita
hu: Explicit implementálás
pt_br: Implemente explicitamente.
ru: Реализовать явно
zh_cn: 显示实现

source: Import list
de: Liste der Imports
es: Lista de importaciones
hu: Import lista
pt_br: Lista de importação
ru: Список импорта
zh_cn: 导入列表

source: Indent size:
de: Einrückung:
es: Tamaño de identación:
hu: Behúzás mérete:
pt_br: Tamanho da identação:
ru: Размер отступа:
zh_cn: 缩进:

source: Initial value
de: Initialer Wert
es: Valor inicial
hu: Kezdőérték
pt_br: Valor inicial
ru: Исходное значение
zh_cn: 初值

source: interface
es: interfaz
hu: interfész
ru: интерфейс
zh_cn: 接口

source: Item
es: Elemento
hu: Elem
ru: Элемент
zh_cn: 成员

# ItemsOfType
source: Items of {0}
de: Items von {0}
es: Elementos de {0}
hu: {0} elemei
pt_br: Itens de {0}
ru: Элементы {0}
zh_cn: {0} 成员

# ItemsSelected
source: {0} selected items.
de: {0} ausgewählte Items.
es: {0} elementos seleccionados.
hu: {0} elem kijelölve
pt_br: {0} itens selecionados.
ru: {0} выделенных элементов.
zh_cn: 已选择 {0} 项。

source: Language
de: Sprache
es: Lenguaje
hu: Nyelv
pt_br: Língua
ru: Язык
zh_cn: 语言

source: Load
de: Laden
es: Cargar
hu: Betöltés
pt_br: Carregar
ru: Загрузить
zh_cn: 载入

# MembersOfType
source: Members of {0}
de: Member von {0}
es: Miembros de {0}
hu: {0} tagjai
pt_br: Membros do {0}
ru: Члены {0}
zh_cn: {0} 成员

# MenuAbout
source: &About NClass...
de: &Über NClass...
es: &Sobre NClass...
hu: &Névjegy...
pt_br: &SobreNClass...
ru: &О NClass...
zh_cn: 关于NClass(&A)

# MenuAddNew
source: &Add New
de: &Neu Hinzufügen
es: Añadir &nuevo
hu: Ú&j
pt_br: &Adicionar Novo
ru: &Создать
zh_cn: 新建(&A)

# MenuAggregation
source: A&ggregation
es: A&gregación
hu: Aggregáció
pt_br: A&gregação
ru: А&грегация
zh_cn: 聚合(&g)

# MenuAssociation
source: &Association
de: &Assoziation
es: &Asociación
hu: Asszociáció
pt_br: &Associação
ru: &Ассоциация
zh_cn: 关联(&A)

# MenuBidirectional
source: &Bidrectional
de: &Bidirectional
es: &Bidireccional
hu: &Kétirányú
ru: &Двунаправленный
zh_cn: 双向性(&B)

# MenuCheckForUpdates
source: Check for &Updates
de: Überprüfe auf &Updates
es: Comprobar ac&tualizaciónes
hu: &Frissítés keresése
pt_br: Verificar &Updates
ru: Проверить &обновления
zh_cn: 检查更新(&U)

# MenuClass
source: &Class
de: &Klasse
es: &Clase
hu: &Osztály
pt_br: &Classe
ru: &Класс
zh_cn: 类(&C)

# MenuComment
source: Commen&t
de: Komme&ntar
es: Come&ntario
hu: &Megjegyzés
pt_br: Come&ntário
ru: Коммен&тарий
zh_cn: 备注(&n)

# MenuCommentRelationship
source: Co&mment Relationship
de: Ko&mmentarverbindung
es: &Relación de comentario
hu: Megjegyzés reláció
pt_br: Co&mentário Relacionamento
ru: Ком&ментировать отношение...
zh_cn: 备注关系(&m)

# MenuComposition
source: C&omposition
de: K&omposition
es: C&omposición
hu: Kompozíció
pt_br: C&omposição
ru: Композиция
zh_cn: 组合(&o)

# MenuContents
source: &Contents
de: &Inhalte
es: &Contenido
hu: &Tartalom
pt_br: &Conteúdo
ru: &Содержимое
zh_cn: 内容(&C)

# MenuCopyImageToClipboard
source: &Copy to Clipboard as Image
de: &Kopiere Bild in die Zwischenablage
es: &Copiar imagen al portapapeles
hu: &Vágólapra mentés képként
pt_br: &Copiar para área de tranferência como imagem
ru: &Копировать изображение
zh_cn: 复制图像到剪贴板(&C)

# MenuCSharpDiagram
source: &C# diagram
de: &C# Diagramm
es: Diagrama &C#
pt_br: &C# diagrama
ru: &C# диаграмма
zh_cn: C#图(&C)

# MenuCut
source: Cu&t
de: Aus&schneiden
es: C&ortar
hu: &Kivágás
pt_br: Cor&tar
ru: &Вырезать
zh_cn: 剪切(&t)

# MenuDelegate
source: &Delegate
de: &Delegat
es: &Delegado
ru: &Делегат
zh_cn: 委托(&D)

# MenuDelete
source: &Delete
de: &Löschen
es: &Eliminar
hu: &Törlés
pt_br: &Deletar
ru: &Удалить
zh_cn: 删除(&D)

# MenuDependency
source: De&pendency
de: &Abhängigkeit
es: &Dependencia
hu: Függőség
pt_br: &Dependencia
ru: &Зависимость
zh_cn: 依赖(&D)

# MenuDiagram
source: &Diagram
de: &Diagramm
es: &Diagrama
pt_br: &Diagrama
ru: &Диаграмма
zh_cn: 图(&D)

# MenuDirection
source: &Direction
de: &Unterordnung
es: &Dirección
hu: &Irány
pt_br: &Direção
ru: &Направление
zh_cn: 方向(&D)

# MenuEdit
source: &Edit
de: &Bearbeiten
es: &Editar
hu: S&zerkesztés
pt_br: &Editar
ru: &Правка
zh_cn: 编辑(&E)

# MenuEditComment
source: &Edit comment...
de: &Bearbeite Kommentar...
es: &Editar commentario...
hu: Megjegyzés &szerkeszése...
pt_br: &Editar comentário...
ru: &Редактировать комментарий...
zh_cn: 编辑备注(&E)...

# MenuEditMembers
source: &Edit members...
de: &Bearbeite Member...
es: &Editar miembros...
hu: Tagok &szerkesztése...
pt_br: &Editar membros...
ru: Редактировать &члены...
zh_cn: 编辑成员(&E)...

# MenuEnum
source: &Enum
de: &Aufzählung
es: &Enumerado
ru: &Перечисление
zh_cn: 枚举(&E)

# MenuExit
source: E&xit
de: S&chließen
es: &Salir
hu: &Kilépés
ru: Вы&ход
zh_cn: 退出(&x)

# MenuExport
source: &Export
de: &Exportieren
es: &Exportar
hu: &Exportálás
pt_br: &Exportar
ru: &Экспорт
zh_cn: 导出(&E)

# MenuFile
source: &File
de: &Datei
es: &Archivo
hu: &Fájl
pt_br: &Arquivo
ru: &Файл
zh_cn: 文件(&F)

# MenuGeneralization
source: Genera&lization
de: Genera&lisierung
es: &Generalización
hu: Öröklődés
pt_br: Genera&lização
ru: Генера&лизация
zh_cn: 泛化(&l)

# MenuGenerateCode
source: &Generate Code...
de: &Erzeuge Code...
es: &Generar código...
hu: &Kódgenerálás...
pt_br: &Generação de Codigo...
ru: &Генерировать код...
zh_cn: 生成代码(&G)...

# MenuHelp
source: &Help
de: &Hilfe
es: A&yuda
hu: &Súgó
pt_br: &Ajuda
ru: &Помощь
zh_cn: 帮助(&H)

# MenuImport
source: &Import
de: &Importieren
es: &Importar
hu: &Importálás
pt_br: &Importar
ru: &Импорт
zh_cn: 导入(&I)

# MenuInitialValue
source: &Initial Value
de: &Initialer Wert
es: &Valor inicial
hu: &Kezdőérték
pt_br: Valor &Inicial
ru: &Исходное значение
zh_cn: 初值(&I)

# MenuInterface
source: &Interface
de: Schn&ittstelle
es: &Interfaz
hu: &Interfész
ru: &Интерфейс
zh_cn: 接口(&I)

# MenuJavaDiagram
source: &Java diagram
de: &Java Diagramm
es: Diagrama &Java
pt_br: &Java diagrama
ru: &Java диаграмма
zh_cn: Java图(&J)

# MenuMembersFormat
source: &Member's Format
de: &Memberformat
es: &Formato de los miembros
hu: Tagok &formátuma
pt_br: Formatar os &Membros
ru: &Форматирование членов
zh_cn: 成员格式(&M)

# MenuNesting
source: &Nesting
de: &Geschachtelt
es: &Anidación
hu: Tartalmazás
ru: &Вложение
zh_cn: 嵌套(&N)

# MenuNew
source: &New
de: &Neu
es: &Nueva
hu: Ú&j
pt_br: &Novo
ru: &Новый
zh_cn: 新建(&N)

# MenuOpen
source: &Open
de: &Öffnen
es: &Abrir
hu: Meg&nyitás
pt_br: &Abrir
ru: &Открыть
zh_cn: 打开(&O)

# MenuOptions
source: &Options...
de: &Optionen...
es: &Opciones...
hu: &Beállítások...
pt_br: &Opções...
ru: &Настройки...
zh_cn: 选项(&O)...

# MenuParameters
source: &Parameters
de: &Parameter
es: &Parametros
hu: &Paraméterek
pt_br: &Parametros
ru: &Параметры
zh_cn: 参数(&P)

# MenuParameterNames
source: Parameter &Names
de: Parameter&namen
es: &Nombre de Parametros
hu: Paraméter&nevek
ru: Имена &параметров
zh_cn: 参数名(&N)

# MenuPaste
source: &Paste
de: &Einfügen
es: &Pegar
hu: &Beillesztés
pt_br: &PColar
ru: &Вставить
zh_cn: 粘贴(&P)

# MenuPlugins
source: &Plugins
es: E&xtensiones
hu: &Bővítmények
ru: &Инструменты
zh_cn: 插件(&P)

# MenuPrint
source: &Print...
de: &Drucken...
es: &Imprimir...
hu: N&yomtatás...
pt_br: Im&pmir...
ru: &Печать...
zh_cn: 打印(&P)...

# MenuRealization
source: &Realization
de: &Realisation
es: &Instanciación
hu: Megvalósítás
pt_br: &Realização
ru: &Реализация
zh_cn: 实现(&R)

# MenuRedo
source: &Redo
de: &Schritt vorwärts
es: &Rehacer
hu: Ú&jra
pt_br: &Refazer
ru: &Повторить
zh_cn: 重做(&R)

# MenuSave
source: &Save
de: &Speichern
es: &Guardar
hu: &Mentés
pt_br: &Salvar
ru: &Сохранить
zh_cn: 保存(&S)

# MenuSaveAs
source: Save &As...
de: Speichern &als...
es: Guardar &como...
hu: Menté&s másként...
pt_br: Salvar &Como...
ru: Сохранить &как...
zh_cn: 另存为(&A)...

# MenuSaveAsImage
source: &Save As Image...
de: &Speichern als Bild...
es: &Guardar como imagen...
hu: Diagram mentése &képként...
pt_br: &Salvar como Imagem...
ru: &Сохранить как изображение...
zh_cn: 图像另存为(&S)...

# MenuSelectAll
source: &Select All
de: &Alles auswählen
es: &Seleccionar todo
hu: &Mindent kijelöl
pt_br: &Selecione todos
ru: &Выделить все
zh_cn: 全选(&S)

# MenuStruct
source: &Structure
de: &Struktur
es: &Estructura
hu: &Struktúra
pt_br: &Structura
ru: &Структура
zh_cn: 结构体(&S)

# MenuType
source: &Type
de: &Typ
es: &Tipo
hu: &Típus
pt_br: &Tipo
ru: &Тип
zh_cn: 类型(&T)

# MenuUndo
source: &Undo
de: &Schritt zurück...
es: &Deshacer
hu: &Visszavonás
pt_br: &Desfazer
ru: &Отменить
zh_cn: 撤消(&U)

source: Modifier:
de: Modifikator:
es: Modificador:
hu: Módosító:
pt_br: Modificador:
ru: Модификатор:
zh_cn: 修饰符:

source: Modifiers
de: Modifikatoren
es: Modificadores
hu: Módosítók
pt_br: Modificadores:
ru: Модификаторы
zh_cn: 修饰符

source: Modify item:
de: Modifizierte Items:
es: Modificar elemento:
hu: Elem módosítása:
pt_br: Modificar Item:
ru: Изменить элемент:
zh_cn: 修改成员:

source: Move Down
de: Nach unten
es: Mover abajo
hu: Lefelé mozgat
pt_br: Mover para Baixo
ru: Вниз
zh_cn: 下移

source: Move Up
de: Nach oben
es: Mover arriba
hu: Felfelé mozgat
pt_br: Mover para Cima
ru: Вверх
zh_cn: 上移

source: Name
es: Nombre
hu: Név
pt_br: Nome
ru: Имя
zh_cn: 名称

source: Nesting
de: Verschachtelung
es: Anidar
hu: Tartalmazás
ru: Вложение
zh_cn: 嵌套

source: New Constructor
de: Neuer Konstruktor
es: Nuevo constructor
hu: Új konstruktor
pt_br: Novo Construtor
ru: Создать конструктор
zh_cn: 新构造函数

source: New Destructor
de: Neuer Destruktor
es: Nuevo destructor
hu: Új destruktor
pt_br: Novo Destrutor
ru: Создать деструктор
zh_cn: 新析构函数

source: New Event
de: Neues Ereignis
es: Nuevo evento
hu: Új esemény
pt_br: Novo Evento
ru: Создать событие
zh_cn: 新事件

source: New Field
de: Neues Feld
es: Nuevo campo
hu: Új tagváltozó
pt_br: Novo Campo
ru: Создать поле
zh_cn: 新域

source: New Method
de: Neue Methode
es: Nuevo método
hu: Új metódus
pt_br: Novo Método
ru: Создать метод
zh_cn: 新方法

source: New Property
de: Neue Eigenschaft
es: Nueva propiedad
hu: Új tulajdonság
pt_br: Nova Propriedade
ru: Создать свойство
zh_cn: 新属性

# NewVersion
source: New version released
de: Neu Version
es: Nueva versión disponible
hu: Új verzió
pt_br: Nova Versão Disponível
ru: Вышла новая версия
zh_cn: 新版本已发布

# NotImplemented
source: This function is not yet implemented.
de: Diese Funktion ist derzeit nicht implementiert.
es: Función todavía no implementada.
hu: Ez a funkció még nincs megvalósítva.
pt_br: Está função não foi implementada
ru: Функция еще не реализована...
zh_cn: 此函数未实现。

# NoUpdates
source: No updates are avaiable.
de: Keine Updates verfügbar.
es: No hay nuevas actualizaciones disponibles
hu: Nincs újabb verzió.
pt_br: Nenhuma atualização disponível
ru: Обноления недоступны.
zh_cn: 没有可用更新

source: Options
de: Optionen
es: Opciones
hu: Beállítások
pt_br: Opções
ru: Опции
zh_cn: 选项

source: Override Members
de: Member überschreiben
es: Miembros sobreescritos
hu: Műveletek felülírása
pt_br: Membros Reescritos
ru: Переопределить члены
zh_cn: 覆盖成员

# PluginTooltip
source: {0} by {1}
de: {0} von {1}
es: {0} creado por {1}
hu: {0}, készítette {1}
pt_br: {0} por {1}
zh_cn: {0} 由 {1} 提供

source: Print
de: Drucken...
es: Imprimir
hu: Nyomtatás
pt_br: Imprimir
ru: Печать
zh_cn: 打印

# ProgramDownload
source: Do you want to download the update now?
de: Es ist ein Update verfügbar, möchten Sie dies herunterladen?
es: ¿Desea descargar la actualización ahora?
hu: Szeretné most letölteni a frissítést?
pt_br: Você quer fazer o donwload da atualização W
ru: Вы хотите загрузить обновление прямо сейчас?
zh_cn: 现在要下载更新吗？

source: Ready
de: Bereit
es: Preparado
hu: Kész
pt_br: Pronto
ru: Готово
zh_cn: 就绪

source: Realization
de: Realisation
es: Instanciación
hu: Megvalósítás
pt_br: Realização
ru: Реализация
zh_cn: 实现

source: Return type:
de: Rückgabewert:
es: Tipo de retorno:
hu: Visszatérési típus:
pt_br: Tipos retornados:
ru: Тип результата:
zh_cn: 委托返回类型:

source: Save
de: Speichern
es: Guardar
hu: Mentés
pt_br: Salvar
ru: Сохранить
zh_cn: 保存

source: Save As
de: Speichern unter...
es: Guardar como
hu: Mentés másként
pt_br: Salvar Como
ru: Сохранить как
zh_cn: 另存为

source: Save As Image
de: Speichern als Bild
es: Guardar como imagen
hu: Mentés képként
pt_br: Salvar como Imagem
ru: Сохранить как изображение
zh_cn: 图像另存为

# SaveChangesConfirmation
source: The file has been changed. Would you like to save the changes?
de: Die Datei wurde geändert, möchten Sie diese Änderungen speichern?
es: El fichero ha cambiado. ¿Deseas guardar los cambios?
hu: A fájl tartalma megváltozott.\nSzerenté elmenteni a módosításokat?
pt_br: O arquivo foi alterado. Você gostaria de salvar as alterações?
ru: Файл был изменен. Сохранить изменения?
zh_cn: 文件已更改，要保存所做的更改吗？

# SendEmail
source: Send e-mail to the program's author
de: Dem Autor eine E-Mail schicken
es: Enviar un correo-e al autor del programa
hu: E-mail küldése a program készítőjének
pt_br: Enviar email para o autor do programa.
ru: Написать письмо автору
zh_cn: 发邮件给作者

source: Sort by Access
de: Sortieren nach Zugriffsmodifikator
es: Ordenar por acceso
hu: Rendezés hozzáférés szerint
pt_br: Organizar por acesso:
ru: Сортировать по доступу
zh_cn: 按访问性排序

source: Sort by Kind
de: Sortieren nach Art
es: Ordenar por categoria
hu: Rendezés fajta szerint
pt_br: Organizar por chave
ru: Сортировать по виду
zh_cn: 按类型排序

source: Sort by Name
de: Sortieren nach Namen
es: Ordenar por nombre
hu: Rendezés név szerint
pt_br: Organizar por nome
ru: Сортировать по имени
zh_cn: 按名称排序

source: Style
es: Estilo
hu: Stílus
pt_br: Estilo
ru: Стиль
zh_cn: 样式

source: Syntax
es: Sintaxis
hu: Szintaktika
pt_br: Sintaxe
ru: Синтаксис
zh_cn: 语法

# TranslationName
source: English
de: German
es: Spanish
hu: Hungarian
pt_br: Brazilian Portuguese
ru: Russian
zh_cn: Chinese

source: Type
de: Typ
es: Tipo
hu: Típus
pt_br: Tipo
ru: Тип
zh_cn: 类型

source: Unknown
de: Unbekannt
es: Desconocido
hu: Ismeretlen
pt_br: Desconhecido
ru: Неизвестно
zh_cn: 未知

source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
hu: Ismeretlen hiba
pt_br: Erro Desconhecido
ru: Наизвестная ошибка
zh_cn: 未知错误

source: Untitled
de: Unbenannt
es: Sin titulo
hu: Névtelen
pt_br: sem Título
zh_cn: 无标题

# UseSnapping
source: Use precision snapping
de: Snapping aktivieren
es: Usar ajuste de precisión
hu: Diagram elemek egymáshoz igazítása
ru: Использовать точную привязку
zh_cn: 使用精确绘图布局

# UseTabs
source: Use tabs for indents
de: Mit Tabulatoren einrücken
es: Usar tabuladores para identación
hu: Tabulátor használata szóközök helyett
pt_br: Use tab para identar
ru: Использовать TAB для отступов
zh_cn: 使用制表符缩进

source: Beta version
es: version Beta
hu: Béta verzió
pt_br: Versão Beta
zh_cn: Beta版本

# VisitHomepage
source: Visit program's homepage
de: Besuchen Sie die Homepage des Entwicklers
es: Visitar la pagina del programa
hu: A program honlapja
pt_br: Visite a home page do programa
ru: Сайт программы...
zh_cn: 访问程序主页

source: Zoom
es: Aumentar/Alejar
hu: Nagyítás
ru: Масштаб
zh_cn: 缩放

source: Zoom In
de: Zoom +
es: Acercar
hu: Nagyítás
ru: Увеличить
zh_cn: 放大

source: Zoom Out
de: Zoom -
es: Alejar
hu: Kicsinyítés
ru: Уменьшить
zh_cn: 缩小

# RequiresNetFramework
source: This program requires the .NET 2.0 Framework. Please download and install the .NET Framework and run this setup again. Do you want to download the framework now?
de: Dieses Programm benötigt das .NET Framwork ab Version 2.0. Bitte installieren Sie zuerst das .NET-Framwerk und starten Sie dann diese Installation erneut.
es: Este programa requiere del Framework .NET 2.0. Por favor descargué e instale el Framework .NET y ejecute este instalador de nuevo. Desea descargar el Framework ahora?
hu: A telepítendő program Microsoft .NET 2.0 keretrendszert használ. Kérem, töltse le és telepítse fel a .NET keretrendszert, majd indítsa újra a telepítőt. Szeretné most letölteni a szükséges keretrendszert a Microsoft honlapjáról?
pt_br: Este programa precisa do .NET 2.0 Framework. Please download and install the .NET Framework and run this setup again. Do you want to download the framework now?
ru: Для работы программы необходим .NET 2.0 Framework. Пожалуста, загрузите и установите .NET Framework, а затем перезапустите установку прогаммы. Вы хотите загрузить .NET Framework сейчас?
zh_cn: 此程序需要.NET 2.0 框架。请下载并安装.NET 2.0 框架后再运行。

# StartMenuGroup
source: Create Start menu group
de: Erzeug einen Eintrag im Startmenü
es: Crear un grupo de menú de Inicio
hu: Csoport elhelyezése a Start menüben
pt_br: Criar grupo no meu Start
ru: Создать группу в Главном меню
zh_cn: 建立开始菜单组

source: Uninstall
de: Deinstallieren
es: Desinstalar
hu: Eltávolítás
pt_br: Desisntalar
ru: Удалить
zh_cn: 卸载

source: Edit text:
de: Kommentar:
es: Editar texto:
hu: Gépelje be a kívánt szöveget:
pt_br: Editar Texto:
ru: Редактировать текст:
zh_cn: 编辑文本:

# ErrorStaticIndexer
source: Indexer cannot be static.
de: Ein Indexer kann nicht statisch sein.
es: Un indizador no puede ser estático.
hu: Indexer nem lehet statikus.
pt_br: Indexador não pode ser estático.
ru: Индексатор не может быть static.
zh_cn: 索引器不能是静态类型。

# TranslationUpdated
source: English translation has been updated.
de: Deutsch Sprachversion wurde aktualisiert
es: La traducción al español ha sido actualizada.
hu: A magyar fordítás frissült.
ru: Обновлен перевод на русский язык
zh_cn: 中文翻译已更新

# ErrorPrinting
source: There was an error while printing: {0}
de: Es ist ein Fehler bei der Ausgabe von {0} aufgetreten
es: Ocurrió un error mientras se imprimia: {0}
hu: Hiba történt a nyomtatás alatt. A hiba oka: {0}
pt_br: Ocorreu um erro durante a impressão: {0}
ru: Произошла ошибка при печати: {0}
zh_cn: 在打印时发生错误: {0}

# MenuDiagramSize
source: &Diagram Size...
es: &Tamaño del diagrama...
hu: &Diagram mérete...
pt_br: Tamanho do &Diagrama...
ru: Размер &диаграммы
zh_cn: 图(&D)大小...

# MenuAlign
source: &Align
de: &Ausrichtung
es: &Alinear
hu: &Igazítás
pt_br: &Alinhamento
ru: &Выровнять
zh_cn: 对齐(&A)

# MenuAlignBottom
source: Align &Bottom
de: Ausrichtung &Unten
es: Alienar a&bajo
hu: &Alulra igazítás
pt_br: Alinhar A&baixo
ru: Выровнять по &нижнему краю
zh_cn: 底部对齐(&B)

# MenuAlignHorizontal
source: Align &Horizontal Center
de: Ausrictung &Horizontal Mitte
es: Alienar centrado &horizontal
hu: &Vízszintesen középre igazítás
pt_br: Alinhas &Horizontal Center
ru: Выровнять по &горизонтальной оси
zh_cn: 水平居中对齐(&H)

# MenuAlignLeft
source: Align &Left
de: Ausrichtung &Links
es: Alinear a la &izquierda
hu: &Balra igazítás
pt_br: Alinhar&Esquedar
ru: Выровнять по &левому краю
zh_cn: 左对齐(&L)

# MenuAlignRight
source: Align &Right
de: Ausrichtung &Rechts
es: Alinear a la &derecha
hu: &Jobbra igazítás
pt_br: Alinhar &Direita
ru: Выровнять по &правому краю
zh_cn: 右对齐(&R)

# MenuAlignTop
source: Align &Top
de: Ausrichtung &Oben
es: Alinear &arriba
hu: &Felülre igazítás
pt_br: Alinhar &Acima
ru: Выровнять по &верхнему краю
zh_cn: 顶端对齐(&T)

# MenuAlignVertical
source: Align &Vertical Center
de: Ausrichtung &Vertikal Zentriert
es: Alinear centrado &vertical
hu: Függőlegesen &középre igazítás
pt_br: Alinhar &Vertical Central
ru: Выровнять по в&ертикальной оси
zh_cn: 垂直居中对齐(&V)

# MenuAutoHeight
source: Auto &Height
de: Automatische &Höhenanpassung
es: Autoajustar &altura
hu: Automatikus &magasság
ru: Автоматическая высота
zh_cn: 自动设置高度(&H)

# MenuAutoWidth
source: Auto &Width
de: Automatische &Breitenanpassung
es: Autoajustar a&nchura
hu: Automatikus &szélesség
ru: Автоматическая ширина
zh_cn: 自动设置宽度(&W)

# MenuCollapseAll
source: &Collapse All
de: &Alles einklappen
es: &Colapsar todos
hu: Mindent &összecsuk
pt_br: &Recolher Tudo
ru: Свернуть все
zh_cn: 全部折叠(&C)

# MenuExpandAll
source: &Expand All
de: &Alles ausklappen
es: &Expandir todos
hu: Mindent &kibont
pt_br: &Expandir todos
ru: Развернуть все
zh_cn: 全部展开(&E)

# MenuMakeSameSize
source: &Make Same Size
de: &Größe angleichen
es: &Igualar en tamaño
hu: &Azonos méretre igazítás
pt_br: &Faça do mesmo tamanho
ru: Одинаковый размер
zh_cn: 使大小相同(&M)

# MenuSameHeight
source: Same &Height
de: &Höhe
es: Misma &altura
hu: Azonos &magasság
pt_br: Mesmo &Altura
ru: По высоте
zh_cn: 相同高度(&H)

# MenuSameSize
source: &Same Size
de: &Höhe und Breite
es: Mismo &tamaño
hu: &Azonos méret
pt_br: Me&smo Tamanho
ru: По высоте и ширине
zh_cn: 相同大小(&S)

# MenuSameWidth
source: Same &Width
de: &Breite
es: Misma a&nchura
hu: Azonos &szélesség
pt_br: Mesma &Largura
ru: По ширине
zh_cn: 相同宽度(&W)

# MenuFormat
source: F&ormat
de: F&ormatiere
es: &Formatear
hu: F&ormázás
pt_br: F&ormatar
ru: Формат
zh_cn: 格式(&o)

source: Always
de: Immer
es: Siempre
hu: Mindig
pt_br: Sempre
ru: Всегда
zh_cn: 总是

source: When mouse hovers
de: Mouse-Hover
es: Cuando el ratón pase por encima
hu: Amikor az egér felette áll
pt_br: Quando mouse passa
ru: При наведении мышью
zh_cn: 在鼠标停留时

source: Never
de: Niemals
es: Nunca
hu: Soha
pt_br: Nunca
ru: Никогда
zh_cn: 从不
